### Pandas Problems:

In [19]:
import pandas as pd

## Data Frame

1. Create a Manual Data Frame

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame
#A data frame has always an assigned

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

2. Arrane the column of the avove data frame in given order: Year> Sate> Pop and what happends in a column in not in the table

In [67]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

#If a column is not in the table. The column will appear wilth "Nan" Values

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

3. Retrieve 2nd row from table using **loc** command

In [23]:
#Pick any rows using loc with index value such as index = 1 for 2nd row

frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

4. Add a new boolean column w.r.t to a column in table

In [41]:
frame["Boolean"] = frame["state"] == "Ohio"
frame

    state  year  pop  Boolean
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

5. Delete the boolean column from above table

In [45]:
del frame["Boolean"]
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

6. Craete any dummy nested dict of dicts Dataframe manually

In [57]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

7. Tranpose above data?

In [58]:
T = frame3.T
T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

8. In above table there is no name of series column. Name the index column as "State"

In [59]:
T.index.name = "State"
T

        2001  2002  2000
State
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

9. In above table there is no name of  Column Header row. Name the columns header row as "Year"

In [61]:
T.columns.name = "Year"
T

Year    2001  2002  2000
State
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

10. Create a 2D 4*4 array from value 0 to 15 and put series column on left and columns name on top to. make it look like a table.

In [70]:
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

11. In above table, Sloice data for colarado row and column two and three: Using location

In [71]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

12. Give same sort of result as above using location of rows and column instead of name using i location

In [73]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

13. What happens if we add two different data sets?

In [78]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
s1+s2
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1,"\n")
print(df2,"\n")
print(df1 + df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

14. How to check duplicacy of values in a column?

In [80]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj.index.is_unique

False

15. Apply idmax function on below df to see index of the maximum value if a column in a table

In [84]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df1["c"].idxmax()

'Colorado'

16. Use Cum sum function to see column vise cummulative count.

In [87]:
df1.cumsum()

            b     c     d
Ohio      0.0   1.0   2.0
Texas     3.0   5.0   7.0
Colorado  9.0  12.0  15.0

17. Install a panda reader library to read online data, and create a data set

In [25]:
import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

all_data

#Below data has 5 columns for each of four comanies: 'AAPL', 'IBM', 'MSFT', 'GOOG'

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2017-01-26   30.610001   30.400000   30.417500   30.485001  105350400.0
 2017-01-27   30.587500   30.400000   30.535000   30.487499   82251600.0
 2017-01-30   30.407499   30.165001   30.232500   30.407499  121510000.0
 2017-01-31   30.347500   30.155001   30.287500   30.337500  196804000.0
 2017-02-01   32.622501   31.752501   31.757500   32.187500  447940000.0
 ...                ...         ...         ...         ...          ...
 2022-01-19  171.080002  165.940002  170.000000  166.229996   94815000.0
 2022-01-20  169.679993  164.179993  166.979996  164.509995   91420500.0
 2022-01-21  166.330002  162.300003  164.419998  162.410004  122501300.0
 2022-01-24  162.300003  154.699997  160.020004  161.619995  162706700.0
 2022-01-25  162.759995  157.020004  158.979996  159.779999  114972000.0

              Adj Close
 Date
 2017-01-26   28.694979
 2017-01-27   28.697329
 2017-01-30   28.622026
 2017-01-31   28.556141
 2017-02-01   30.297508
 ...                ...
 2022-01-19  166.229996
 2022-01-20  164.509995
 2022-01-21  162.410004
 2022-01-24  161.619995
 2022-01-25  159.779999

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2017-01-26  171.013382  169.703629  170.229446  170.803055   3204839.0
 2017-01-27  171.319305  169.502869  170.621414  169.502869   3642486.0
 2017-01-30  169.282990  166.902481  169.196945  168.068832   4283161.0
 2017-01-31  167.858505  165.975143  167.351822  166.845123   4329394.0
 2017-02-01  167.973236  165.286804  167.304016  166.625244   2924302.0
 ...                ...         ...         ...         ...         ...
 2022-01-19  133.899994  131.500000  132.899994  131.580002   4103700.0
 2022-01-20  132.880005  130.570007  131.259995  130.820007   5278200.0
 2022-01-21  131.869995  129.270004  131.649994  129.350006   5905000.0
 2022-01-24  129.149994  124.190002  127.989998  128.820007  13777600.0
 2022-01-25  137.339996  128.300003  129.139999  136.100006  19700100.0

              Adj Close
 Date
 2017-01-26  135.797882
 2017-01-27  134.764160
 2017-01-30  133.624023
 2017-01-31  132.651093
 2017-02-01  132.476257
 ...                ...
 2022-01-19  131.580002
 2022-01-20  130.820007
 2022-01-21  129.350006
 2022-01-24  128.820007
 2022-01-25  136.100006

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2017-01-26   64.540001   63.549999   64.120003   64.269997  43554600.0
 2017-01-27   65.910004   64.889999   65.389999   65.779999  44818000.0
 2017-01-30   65.790001   64.800003   65.690002   65.129997  31651400.0
 2017-01-31   65.150002   64.260002   64.860001   64.650002  25270500.0
 2017-02-01   64.620003   63.470001   64.360001   63.580002  39671500.0
 ...                ...         ...         ...         ...         ...
 2022-01-19  313.910004  302.700012  306.290009  303.329987  45933900.0
 2022-01-20  311.649994  301.140015  309.070007  301.600006  35380700.0
 2022-01-21  304.109985  295.609985  302.690002  296.029999  57118300.0
 2022-01-24  297.109985  276.049988  292.200012  296.369995  86035400.0
 2022-01-25  294.989990  285.170013  291.519989  288.489990  69838900.0

              Adj Close
 Date
 2017-01-26   59.756840
 2017-01-27   61.160809
 2017-01-30   60.556461
 2017-01-31   60.110165
 2017-02-01   59.115288
 ...                ...
 2022-01-19  303.329987
 2022-01-20  301.600006
 2022-01-21  296.029999
 2022-01-24  296.369995
 2022-01-25  288.489990

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2017-01-26   838.000000   827.010010   837.809998   832.150024  2973900
 2017-01-27   841.950012   820.440002   834.710022   823.309998  2965800
 2017-01-30   815.840027   799.799988   814.659973   802.320007  3246600
 2017-01-31   801.250000   790.520020   796.859985   796.789978  2160600
 2017-02-01   801.190002   791.190002   799.679993   795.695007  2029700
 ...                 ...          ...          ...          ...      ...
 2022-01-19  2767.989990  2710.000000  2738.770020  2713.040039  1039800
 2022-01-20  2758.239990  2662.889893  2730.280029  2670.129883  1096500
 2022-01-21  2695.209961  2600.020020  2660.239990  2601.840088  2087000
 2022-01-24  2615.570068  2492.839111  2520.550049  2607.439941  2764600
 2022-01-25  2586.770020  2527.560059  2568.709961  2534.709961  1791200

               Adj Close
 Date
 2017-01-26   832.150024
 2017-01-27   823.309998
 2017-01-30   802.320007
 2017-01-31   796.789978
 2017-02-01   795.695007
 ...                 ...
 2022-01-19  2713.040039
 2022-01-20  2670.129883
 2022-01-21  2601.840088
 2022-01-24  2607.439941
 2022-01-25  2534.709961

 [1259 rows x 6 columns]}

18. From above table Make two data frames: One for "Adj Close" for each brand, and other for "Volume" for each brand

In [22]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                        for ticker, data in all_data.items()})

print(price,"\n")
print(volume)

                  AAPL         IBM        MSFT         GOOG
Date
2017-01-26   28.694975  135.797852   59.756836   832.150024
2017-01-27   28.697330  134.764175   61.160805   823.309998
2017-01-30   28.622026  133.624039   60.556446   802.320007
2017-01-31   28.556137  132.651093   60.110157   796.789978
2017-02-01   30.297508  132.476288   59.115295   795.695007
...                ...         ...         ...          ...
2022-01-19  166.229996  131.580002  303.329987  2713.040039
2022-01-20  164.509995  130.820007  301.600006  2670.129883
2022-01-21  162.410004  129.350006  296.029999  2601.840088
2022-01-24  161.619995  128.820007  296.369995  2607.439941
2022-01-25  159.779999  136.100006  288.489990  2534.709961

[1259 rows x 4 columns]

                   AAPL         IBM        MSFT     GOOG
Date
2017-01-26  105350400.0   3204839.0  43554600.0  2973900
2017-01-27   82251600.0   3642486.0  44818000.0  2965800
2017-01-30  121510000.0   4283161.0  31651400.0  3246600
2017-01-31  196804000.0   4329394.0  25270500.0  2160600
2017-02-01  447940000.0   2924302.0  39671500.0  2029700
...                 ...         ...         ...      ...
2022-01-19   94815000.0   4103700.0  45933900.0  1039800
2022-01-20   91420500.0   5278200.0  35380700.0  1096500
2022-01-21  122501300.0   5905000.0  57118300.0  2087000
2022-01-24  162706700.0  13777600.0  86035400.0  2764600
2022-01-25  114972000.0  19700100.0  69838900.0  1791200

[1259 rows x 4 columns]

19. We can observe that values are changing for each day in Price data set. Can we see the perecent change row wise?

In [27]:
returns = price.pct_change()
returns
#.pct_change is time series function to see row wise percent change

                AAPL       IBM      MSFT      GOOG
Date
2017-01-26       NaN       NaN       NaN       NaN
2017-01-27  0.000082 -0.007612  0.023495 -0.010623
2017-01-30 -0.002624 -0.008460 -0.009881 -0.025495
2017-01-31 -0.002302 -0.007281 -0.007370 -0.006893
2017-02-01  0.060981 -0.001318 -0.016551 -0.001374
...              ...       ...       ...       ...
2022-01-19 -0.021025 -0.010230  0.002247 -0.004685
2022-01-20 -0.010347 -0.005776 -0.005703 -0.015816
2022-01-21 -0.012765 -0.011237 -0.018468 -0.025575
2022-01-24 -0.004864 -0.004097  0.001149  0.002152
2022-01-25 -0.011385  0.056513 -0.026588 -0.027893

[1259 rows x 4 columns]

20. Find the correlation between "MSFT" AND "IBM" brand in returns column

In [30]:
returns['MSFT'].corr(returns['IBM'])

0.4858059907751391

21. Find the covariance and covariance between "MSFT" AND "IBM" brand in returns column

In [40]:
returns['MSFT'].cov(returns['IBM'])

0.00014123909979719753

22. Find the correlation among all columns in a data frame

In [39]:
print(returns['MSFT'].cov(returns['IBM']),"\n"*2)

print(returns.cov())

0.00014123909979719753


          AAPL       IBM      MSFT      GOOG
AAPL  0.000371  0.000137  0.000248  0.000218
IBM   0.000137  0.000278  0.000141  0.000131
MSFT  0.000248  0.000141  0.000304  0.000233
GOOG  0.000218  0.000131  0.000233  0.000293

23. Find the correlation between same columns in two different datasets. Take returns and volume here

In [42]:
returns.corrwith(volume)

AAPL   -0.072102
IBM    -0.128292
MSFT   -0.077554
GOOG   -0.114002
dtype: float64